Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/kata/tomcat/target_count_8/repeat_26/7.txt
2020/01/26 15:35:38 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8007/
2020/01/26 15:36:08 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 90844 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8007
Document Path:          /
Document Length:        713 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      90844
Failed requests:        0
Non-2xx responses:      90861
Total transferred:      78867348 bytes
HTML transferred:       64783893 bytes
Requests per second:    3028.08 [#/sec] (mean)
Time per request:       33.024 [ms] (mean)
Time per request:       0.330 [ms] (mean, across all concurrent requests)
Transfer rate:          2567.25 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   12  51.9      3    1087
Processing:     0   21  38.1      7     652
Waiting:        0   19  34.7      7     543
Total:          1   32  69.6     12    1178
Percentage of the requests served within a certain time (ms)
  50%     12
  66%     17
  75%     24
  80%     33
  90%     87
  95%    140
  98%    212
  99%    277
 100%   1178 (longest request)
2020/01/26 15:36:08 Matched stat line [Connect:        0   12  51.9      3    1087 Connect 0 12 51.9 3 1087]
2020/01/26 15:36:08 Matched stat line [Processing:     0   21  38.1      7     652 Processing 0 21 38.1 7 652]
2020/01/26 15:36:08 Matched stat line [Waiting:        0   19  34.7      7     543 Waiting 0 19 34.7 7 543]
2020/01/26 15:36:08 Matched stat line [Total:          1   32  69.6     12    1178 Total 1 32 69.6 12 1178]
2020/01/26 15:36:08 Matched percentline [  50%     12 50 12]
2020/01/26 15:36:08 Matched percentline [  66%     17 66 17]
2020/01/26 15:36:08 Matched percentline [  75%     24 75 24]
2020/01/26 15:36:08 Matched percentline [  80%     33 80 33]
2020/01/26 15:36:08 Matched percentline [  90%     87 90 87]
2020/01/26 15:36:08 Matched percentline [  95%    140 95 140]
2020/01/26 15:36:08 Matched percentline [  98%    212 98 212]
2020/01/26 15:36:08 Matched percentline [  99%    277 99 277]
2020/01/26 15:36:08 Matched percentline [ 100%   1178 100 1178]
{"connect":{"max":1087,"mean":12,"median":3,"min":0,"stdDev":51.900001525878906},"percentiles":{"100":1178,"50":12,"66":17,"75":24,"80":33,"90":87,"95":140,"98":212,"99":277},"processing":{"max":652,"mean":21,"median":7,"min":0,"stdDev":38.099998474121094},"total":{"max":1178,"mean":32,"median":12,"min":1,"stdDev":69.5999984741211},"waiting":{"max":543,"mean":19,"median":7,"min":0,"stdDev":34.70000076293945}}